package utils

object StringUtil {

  private val halfAlphabetsAndNums = "[A-Za-z0-9]".r
  private val hiraR = "[\u3041-\u3096]".r

  private val kanaMap: Map[String, String] = Map(
    "ｶﾞ" -> "ガ", "ｷﾞ" -> "ギ", "ｸﾞ" -> "グ", "ｹﾞ" -> "ゲ", "ｺﾞ" -> "ゴ",
    "ｻﾞ" -> "ザ", "ｼﾞ" -> "ジ", "ｽﾞ" -> "ズ", "ｾﾞ" -> "ゼ", "ｿﾞ" -> "ゾ",
    "ﾀﾞ" -> "ダ", "ﾁﾞ" -> "ヂ", "ﾂﾞ" -> "ヅ", "ﾃﾞ" -> "デ", "ﾄﾞ" -> "ド",
    "ﾊﾞ" -> "バ", "ﾋﾞ" -> "ビ", "ﾌﾞ" -> "ブ", "ﾍﾞ" -> "ベ", "ﾎﾞ" -> "ボ",
    "ﾊﾟ" -> "パ", "ﾋﾟ" -> "ピ", "ﾌﾟ" -> "プ", "ﾍﾟ" -> "ペ", "ﾎﾟ" -> "ポ",
    "ｳﾞ" -> "ヴ", "ﾜﾞ" -> "ヷ", "ｦﾞ" -> "ヺ",
    "ｱ" -> "ア", "ｲ" -> "イ", "ｳ" -> "ウ", "ｴ" -> "エ", "ｵ" -> "オ",
    "ｶ" -> "カ", "ｷ" -> "キ", "ｸ" -> "ク", "ｹ" -> "ケ", "ｺ" -> "コ",
    "ｻ" -> "サ", "ｼ" -> "シ", "ｽ" -> "ス", "ｾ" -> "セ", "ｿ" -> "ソ",
    "ﾀ" -> "タ", "ﾁ" -> "チ", "ﾂ" -> "ツ", "ﾃ" -> "テ", "ﾄ" -> "ト",
    "ﾅ" -> "ナ", "ﾆ" -> "ニ", "ﾇ" -> "ヌ", "ﾈ" -> "ネ", "ﾉ" -> "ノ",
    "ﾊ" -> "ハ", "ﾋ" -> "ヒ", "ﾌ" -> "フ", "ﾍ" -> "ヘ", "ﾎ" -> "ホ",
    "ﾏ" -> "マ", "ﾐ" -> "ミ", "ﾑ" -> "ム", "ﾒ" -> "メ", "ﾓ" -> "モ",
    "ﾔ" -> "ヤ", "ﾕ" -> "ユ", "ﾖ" -> "ヨ",
    "ﾗ" -> "ラ", "ﾘ" -> "リ", "ﾙ" -> "ル", "ﾚ" -> "レ", "ﾛ" -> "ロ",
    "ﾜ" -> "ワ", "ｦ" -> "ヲ", "ﾝ" -> "ン",
    "ｧ" -> "ァ", "ｨ" -> "ィ", "ｩ" -> "ゥ", "ｪ" -> "ェ", "ｫ" -> "ォ",
    "ｯ" -> "ッ", "ｬ" -> "ャ", "ｭ" -> "ュ", "ｮ" -> "ョ",
  )
  private val halfKanaR = kanaMap.keys.toList.mkString("|").r
  
  
  def halfToFull(s: String): String = {
    val fs: List[(String => String)] = List(
      s => halfAlphabetsAndNums.replaceAllIn(s, _.group(0).map(c => (c + 0xFEE0).toChar)),
      s => halfKanaR.replaceAllIn(s, m => kanaMap.getOrElse(m.group(0), "")),
      s => s.replace("ﾞ", "゛").replace("ﾟ", "゜"),
    )
    fs.foldLeft(s)((s, f) => f(s))
  }

  def hiraToKana(s: String): String = {
    hiraR.replaceAllIn(s, _.group(0).map(c => (c + 0x60).toChar))
  }
  
}
